In [1]:
import pandas as pd

In [2]:
students = pd.read_csv("students.csv")
courses = pd.read_csv("courses.csv")
registrations = pd.read_csv("registrations.csv")

In [12]:
courses.head()

     id         name  credits start_course  end_course
0  C001     Calculus        3   2025-09-01  2025-12-15
1  C002      Physics        4   2025-09-01  2025-12-15
2  C003  Programming        3   2025-09-01  2025-12-15

In [8]:
for _, row in registrations.iterrows():
    student_id = row['student_id']
    course_id = row['course_id']
    print(f"Student ID: {student_id}, Course ID: {course_id}")

Student ID: S001, Course ID: C001
Student ID: S001, Course ID: C003
Student ID: S002, Course ID: C002
Student ID: S003, Course ID: C001
Student ID: S004, Course ID: C003
Student ID: S005, Course ID: C002
Student ID: S005, Course ID: C003

In [11]:
pd.isna(student_id)
students

     id          name          email    birthday sex
0  S001  Nguyen Van A  a@example.com  2000-01-15   M
1  S002    Tran Thi B  b@example.com  2001-05-20   F
2  S003      Le Van C  c@example.com  1999-07-30   M
3  S004    Pham Thi D  d@example.com  2002-03-10   F
4  S005   Hoang Van E  e@example.com  2000-11-25   M